/*
 * datatoMMXU.h
 *
 *  Created on: 20.04.2017
 *      Author: sagok
 *
// 901
// ---------------------------------
// ћодуль 1 неизменный
// изделие			верси€		дискрет			реле
// 901				до 2.11 	0				10(1-10)
// 901T24N0D40R35	2.12 		0				10(1-10)
// ......

// ---------------------------------
// ћодуль 2
// изделие			верси€		дискрет			реле
// 901				до 2.11 	8(1-8)			8(11-18)
// 901T24N0D40R35	2.12 		24(1-24)		8(11-18)
// 901T24N0D32R43	2.12 		16(1-16)		16(11-16)
// 901T24N0D24R51	2.12 		0				32(11-32)
// 901T20N4D32R35	2.12 		24(1-24)		8(11-18)

// ---------------------------------
// ћодуль 3
// изделие			верси€		дискрет			реле
// 901				до 2.11 	16(9-24)		0
// 901T24N0D40R35	2.12 		16(25-40)		16(19-35)
// 901T24N0D32R43	2.12 		16(17-32)		16(17-43)
// 901T24N0D24R51	2.12 		24(1-24)		8(33-51)
// 901T20N4D40R35	2.12 		16(25-40)		16(19-35)

// аналоговые модули
// ---------------------------------
// ћодуль 4
// изделие			верси€		напр€жение		ток
// 901				до 2.11 	0				8
// 901T24N0D40R35	2.12 		0				8
// 901T24N0D32R43	2.12 		0				8
// 901T24N0D24R51	2.12 		0				8
// 901T20N4D40R35	2.12 		0				8

// ---------------------------------
// ћодуль 5
// изделие			верси€		напр€жение		ток
// 901				до 2.11 	0				8
// 901T24N0D40R35	2.12 		0				8
// 901T24N0D32R43	2.12 		0				8
// 901T24N0D24R51	2.12 		0				8
// 901T20N4D40R43	2.12 		0				8

// ---------------------------------
// ћодуль 6
// изделие			верси€		напр€жение		ток
// 901				до 2.11 	-				-
// 901T24N0D40R35	2.12 		0				8
// 901T24N0D32R43	2.12 		0				8
// 901T24N0D24R51	2.12 		0				8
// 901T20N4D40R35	2.12 		4				4

// ---------------------------------
 */

#ifndef DATATOMMXU_H_
#define DATATOMMXU_H_

#define sqrt3	1.7320508075688772935274463415059

#define		DbPercent		100000		// 0,001%

float	GetRealU(uint32_t	Currdata, uint16_t	ktn);
float	GetRealP(float	Currdata, uint16_t	ktn,  uint16_t	Ittf);

int		Set_MMXU	(uint16_t QTnum, uint64_t currentTime );
int		Set_MMXN	(uint16_t QTnum, uint64_t currentTime );

#endif /* DATATOMMXU_H_ */
